#### RailTypeDefaultJoinOption Enumeration

---

|  |
| --- |
| See Also |

The default join type of the rail.

**Namespace:**   Autodesk.Revit.DB.Architecture
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public enum RailTypeDefaultJoinOption ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration RailTypeDefaultJoinOption ``` |

| Visual C++ |
| --- |
| ``` public enum class RailTypeDefaultJoinOption ``` |

# Members

| Member name | Description |
| --- | --- |
| Miter | The rails will be joined by a miter connection. |
| Fillet | The rails will be joined by a fillet connection. |

# See Also

Autodesk.Revit.DB.Architecture Namespace